app/views/conversations/show.html.haml

SELECT "turns".* FROM "turns" WHERE "turns"."conversation_id" = $1  [["conversation_id", 1]]
---

- @conversation.turns.each do |turn|