app/controllers/conversations_controller.rb

INSERT INTO "conversations" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "davidwkaiser@yahoo.com"], ["created_at", "2016-06-01 02:48:32.344030"], ["updated_at", "2016-06-01 02:48:32.344030"]]
INSERT INTO "turns" ("utterance", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["utterance", "What would you like to get from our session today?"], ["conversation_id", 1], ["created_at", "2016-06-01 02:48:32.618182"], ["updated_at", "2016-06-01 02:48:32.618182"]]
---
  def create
    @conversation = Conversation.new(conversation_params)
    if @conversation.save
      flash[:notice] = ["Let's get started!"]
      @conversation.turns << Turn.new(utterance: @conversation.first_question)

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @conversation = Conversation.find(params[:id])

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
    @conversation = Conversation.find(params[:id])