app/controllers/turns_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "turns" ("utterance", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["utterance", "clarity"], ["conversation_id", 1], ["created_at", "2016-06-01 02:48:39.154788"], ["updated_at", "2016-06-01 02:48:39.154788"]]
---
  def create
    @conversation = Conversation.find(params[:conversation_id])
    @turn = @conversation.turns.create(turn_params)